MultiIndex Series and DataFrame

In [2]:
import numpy as numpy
import pandas as pd

In [3]:
# how to create multiindex object
# 1. pd.MultiIndex.from_tuples()
index = pd.MultiIndex.from_tuples([
    ('USA', 'New York'),
    ('USA', 'California'),
    ('India', 'Delhi'),
    ('India', 'Mumbai')
], names=['Country', 'City'])

df = pd.DataFrame({
    'Population': [8419600, 39538223, 31870000, 20411000],
    'GDP': [1.5, 3.9, 0.3, 0.4]
}, index=index)

df

                    Population  GDP
Country City
USA     New York       8419600  1.5
        California    39538223  3.9
India   Delhi         31870000  0.3
        Mumbai        20411000  0.4

In [4]:
# Accessing Rows in DataFrame Using .loc[]
df.loc['USA']

            Population  GDP
City
New York       8419600  1.5
California    39538223  3.9

In [5]:
#2Ô∏è Accessing Specific City
df.loc[('USA', 'New York')]

Population    8419600.0
GDP                 1.5
Name: (USA, New York), dtype: float64

In [6]:
df.sort_index()

                    Population  GDP
Country City
India   Delhi         31870000  0.3
        Mumbai        20411000  0.4
USA     California    39538223  3.9
        New York       8419600  1.5

In [7]:
# 2. pd.MultiIndex.from_product()
countries = ['USA', 'India']
cities = ['New York', 'Delhi']

index = pd.MultiIndex.from_product([countries, cities], names=['Country', 'City'])
index

df2 = pd.DataFrame({'Population': [8419600, 31870000, 39538223, 20411000]}, index=index)
df2

                  Population
Country City
USA     New York     8419600
        Delhi       31870000
India   New York    39538223
        Delhi       20411000

In [8]:
# creating a series with multiindex object
index = pd.MultiIndex.from_tuples([
    ('USA', 'New York'),
    ('USA', 'California'),
    ('India', 'Delhi'),
    ('India', 'Mumbai')
], names=['Country', 'City'])

population = pd.Series([8419600, 39538223, 31870000, 20411000], index=index)

population

Country  City
USA      New York       8419600
         California    39538223
India    Delhi         31870000
         Mumbai        20411000
dtype: int64

In [9]:
# how to fetch items from such a series
population.loc['India']
population.loc['India']['Delhi'].item()

31870000

In [10]:
# stack()
data = {
    'Math': [90, 85, 80],
    'Science': [95, 88, 92]
}
index = ['Alice', 'Bob', 'Charlie']
df = pd.DataFrame(data, index=index)
df

         Math  Science
Alice      90       95
Bob        85       88
Charlie    80       92

In [11]:
# Applying stack()
stacked_df = df.stack()
stacked_df
stacked_df.loc['Bob']

Math       85
Science    88
dtype: int64

In [17]:
# unstack()
index = pd.MultiIndex.from_tuples([
    ('Alice', 'Math'),
    ('Alice', 'Science'),
    ('Bob', 'Math'),
    ('Bob', 'Science'),
    ('Charlie', 'Math'),
    ('Charlie', 'Science')
], names=['Student', 'Subject'])

scores = pd.Series([90, 95, 85, 88, 80, 92], index=index)
scores

Student  Subject
Alice    Math       90
         Science    95
Bob      Math       85
         Science    88
Charlie  Math       80
         Science    92
dtype: int64

In [19]:
# applying unstack()
unstacked_score = scores.unstack()
unstacked_score
unstacked_score['Math']

Student
Alice      90
Bob        85
Charlie    80
Name: Math, dtype: int64

In [24]:
df.head()
df.shape
df.duplicated()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Alice to Charlie
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Math     3 non-null      int64
 1   Science  3 non-null      int64
dtypes: int64(2)
memory usage: 180.0+ bytes

In [27]:
# melt()
df = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02'],
    'Product_A': [100, 120],
    'Product_B': [150, 130]
})
df
df_long = df.melt(id_vars=['Date'], var_name='Product', value_name='Sales')
df_long

         Date    Product  Sales
0  2024-01-01  Product_A    100
1  2024-01-02  Product_A    120
2  2024-01-01  Product_B    150
3  2024-01-02  Product_B    130

In [29]:
# pivot()
df = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'Product': ['A', 'B', 'A', 'B'],
    'Sales': [100, 150, 120, 130]
})
df
df_wide = df.pivot(index='Date', columns='Product', values='Sales')
df_wide

Product       A    B
Date
2024-01-01  100  150
2024-01-02  120  130

In [31]:
# pivot_table()
df = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-01', '2024-01-01', '2024-01-02', '2024-01-02'],
    'Product': ['A', 'A', 'B', 'A', 'B'],
    'Sales': [100, 110, 150, 120, 130]
})
df
df_wide = df.pivot_table(index='Date', columns='Product', values='Sales', aggfunc='sum', fill_value=0)
df_wide

Product       A    B
Date
2024-01-01  210  150
2024-01-02  120  130

In [33]:
!pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in ./myenv/lib/python3.12/site-packages (from seaborn) (2.2.2)
Requirement already satisfied: pandas>=1.2 in ./myenv/lib/python3.12/site-packages (from seaborn) (2.2.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in ./myenv/lib/python3.12/site-packages (from seaborn) (3.10.0)
Requirement already satisfied: contourpy>=1.0.1 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.1)
Requirement already satisfied: cycler>=0.10 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.56.0)
Requirement already satisfied: kiwisolver>=1.3.1 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.8)
Requirement already satisfied: packaging>=20.0 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.2)
Requirement already satisfied: pillow>=8 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (11.1.0)
Requirement already satisfied: pyparsing>=2.3.1 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.1)
Requirement already satisfied: python-dateutil>=2.7 in ./myenv/lib/python3.12/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./myenv/lib/python3.12/site-packages (from pandas>=1.2->seaborn) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in ./myenv/lib/python3.12/site-packages (from pandas>=1.2->seaborn) (2025.1)
Requirement already satisfied: six>=1.5 in ./myenv/lib/python3.12/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 294.9/294.9 kB 6.3 MB/s eta 0:00:00a 0:00:01
Installing collected packages: seaborn
Successfully installed seaborn-0.13.2

In [35]:
import seaborn as sns
df = sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [40]:
# find total average bill of male and female
df.groupby('sex', observed=False)['total_bill'].mean()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [41]:
df.groupby(['sex', 'smoker'], observed=False)[['total_bill']].mean().unstack()

       total_bill
smoker        Yes         No
sex
Male    22.284500  19.791237
Female  17.977879  18.105185

In [42]:
df.pivot_table(index='sex', columns='smoker', values='total_bill', observed=False)

smoker        Yes         No
sex
Male    22.284500  19.791237
Female  17.977879  18.105185

In [44]:
df.pivot_table(index='sex', columns='smoker', values='total_bill', observed=False, aggfunc='sum')

smoker      Yes       No
sex
Male    1337.07  1919.75
Female   593.27   977.68